
[Speciality]
ID_ASSAULT=Assault
ID_DEMOLITIONS=Demolitions
ID_ELECTRONICS=Electronics
ID_RECON=Recon
ID_SNIPER=Sniper
[R6Operative1]
ID_BIRTHDATE=1968.01.01
ID_HEIGHT=186cm
ID_HISTORY=Born in Málaga, Spain. Although the family's holdings were greatly reduced under Franco's rule, the Arnaviscas still control large tracts of farmland around Córdoba and the Guadalqivir river valley. The second youngest son in a family of eight, his eldest brother is a deputy in the Andalucian Parliament. Attended University of Seville, 1983-88. Joined the Guardia Civil upon graduation. Served as a brigade commander 1994-96 in the Western European Union (WEU) administration of Mostar in Bosnia where he was instrumental in rebuilding the local police force. In 1997 recruited by the Guardia Civil's counter-terrorism unit, the Unidad Especial de Intervención (UEI), as part of their focus on the growing threat of terrorist action within the European Union by former citizens of Yugoslavia.\n\nArnavisca has competed in shooting competitions since he was a child and is an expert marksman. He speaks English, German and Italian fluently, as well as his native Spanish, and can make himself under
ID_HISTORY1=stood in most other European languages. Despite his aristocratic bearing, he is more comfortable acting as a lieutenant and advisor than a team leader. Extremely tenacious in combat, he has a reputation for maintaining an air of calm detachment no matter how tense the situation.
ID_NAME=Arnavisca, Santiago
ID_SHORTNAME=Arnavisca, S.
ID_WEIGHT=81kg
[R6Operative2]
ID_BIRTHDATE=1953.08.21
ID_HEIGHT=176cm
ID_HISTORY=Born on a farm near Chemnitz on the Czechoslovakian border in what was, at the time, the German Democratic Republic (East Germany). Drafted into the East Germany Army, 1970. Specialized in bomb disposal and demolitions. Assigned to East German Border Patrol, 1971-76. Arrested by the GDR State Security Service (Stasi) in 1976 under suspicion of involvement in several high-profile defections. Released for lack of evidence and discharged from army in 1977. Movements and activities from 1977-84 are unknown. The current German government will neither confirm nor deny rumors that he was a member of the "Libellen", an underground group held responsible for several bombings of East German governmental offices in and around Berlin in the summer of 1981. Resurfaced in 1985 when he was granted asylum by West Germany after a risky crossing of the Baltic Sea in a small sailboat. Opened Pyrotechno GmbH, a security consulting firm, in 1989. Since then he has built his reputation as Germany'
ID_HISTORY1=s leading expert on explosives and demolitions. Married, 1995. Two children.\n\nBeckenbauer has an encyclopedic knowledge of all types of explosive devices. Years of working with bombs have made him extremely meticulous. He never overlooks any detail of an operation and leaves nothing to chance. In his relations with the rest of the team he is liable to be somewhat cold and distant, but only because he is so completely focused on his job that he considers personal interactions to be a dangerous distraction.
ID_NAME=Beckenbauer, Lars
ID_SHORTNAME=Beckenbauer, L.
ID_WEIGHT=87kg
[R6Operative3]
ID_BIRTHDATE=1954.10.12
ID_HEIGHT=188cm
ID_HISTORY=Born in Keokuk, Iowa, USA. Father is a local deputy sheriff, mother a homemaker. Two brothers. Attended University of Iowa on a track & field scholarship, 1972-76. Graduated with honors with a degree in law enforcement. Worked for three years as a patrolman in Keokuk police department. Hired in 1980 by the Federal Bureau of Investigation. Member of FBI Hostage Rescue Team 1987-97. Married since 1979. Wife and two teenage children live in Maine, USA.\n\nBogart is an excellent team lead. He has exceptional tactical skills and situational awareness from his years with HRT. Extremely cool under fire, he is also a crack shot, having won several marksmanship awards during his tenure at the FBI. His low-key demeanor and laconic sense of humor have made him a well-liked member of the RAINBOW team.
ID_NAME=Bogart, Daniel
ID_SHORTNAME=Bogart, D.
ID_WEIGHT=82kg
[R6Operative4]
ID_BIRTHDATE=1968.01.12
ID_HEIGHT=176cm
ID_HISTORY=Born in Manchester, England. Whereabouts of father unknown. Mother is a secretary at a plastics processing plant in Leeds. Three siblings, two brothers and a sister. Joined Royal Marines in 1986. Two tours of duty with British Special Air Service (SAS) , 1989-91 and 1996-1999. Awarded Military Cross, 1998. Has taken part in SAS actions in twenty-two countries on four continents. Further details of his service record are sealed. Unmarried.\n\nBurke is a seasoned veteran of numerous covert operations. While not reckless, he has a strong can-do attitude and unlimited confidence in his abilities. As a leader he is decisive and demanding. He has a quick sense of humor and is likely to keep his team relaxed by telling jokes before the start of a mission. While he has some contact with his immediate family, he considers the service to be his home.
ID_NAME=Burke, Andrew
ID_SHORTNAME=Burke, A.
ID_WEIGHT=72kg
[R6Operative5]
ID_BIRTHDATE=1968.01.12
ID_HEIGHT=176cm
ID_HISTORY=Born in Los Angeles, California. Joined U.S. Army, 1983. Served with the 7th Infantry Division, 1984-87. Rose to rank of Staff Sergeant before being recruited by the American Central Intelligence Agency (CIA) in 1987 for narcotics interdiction operations in South America. Discharged, 1988 and became a full-time CIA employee the same year, working under John Clark. Service records for the years 1989-99 are sealed. Earned BS Political Science, George Mason University, 1995. MA International Relations from the same institution 1999. Married.\n\nChavez is an excellent light infantry soldier with an exceptional grasp of small unit tactics and close quarters battle. Although small in stature he is powerfully built and agile, a formidable opponent with a wide range of weapons and in hand-to-hand combat.
ID_NAME=Chavez, Ding
ID_SHORTNAME=Chavez, D.
ID_WEIGHT=72kg
[R6Operative6]
ID_BIRTHDATE=1967.09.27
ID_HEIGHT=174cm
ID_HISTORY=Born in Chantilly, France. Father is a manuscript curator at a local museum, mother is a journalist. Four sisters and two brothers. Second oldest sister is a prominent professor of mathematics at the University of Paris. Attended the Ecole Supérieure d'Ingénieurs en Electrotechnique et Electronique (ESIEE) in Paris, 1984-89. Graduated with a degree in electronics engineering and computer science. Joined the Gendarmerie Nationale in 1990 as an officer in their computer crime division. Instrumental in thwarting a 1994 attempt by a group of Algerian nationals to bring down the French Minitel computer network using a virus spread by telephone switching software. In 1996 he was recruited by the Groupe d'Intervention Gendarmerie Nationale (GIGN), France's elite counter-terrorist unit, as a specialist in telephony and electronic surveillance. Unmarried.\n\nDuBarry is an expert on computers and computer nets as well as more conventional forms of surveillance. Although his role in CT a
ID_HISTORY1=ctions is usually intelligence gathering and communications, as a veteran of GIGN's extensive combat training he is fully qualified to participate in armed operations. Introverted and thoughtful, and an excellent tactician, he often makes connections that other team members miss. Off-duty he is an avid amateur scuba diver and is an officer in the Confédération Mondiale des Activités Subaquatiques (CMAS).
ID_NAME=DuBarry, Alain
ID_SHORTNAME=DuBarry, A.
ID_WEIGHT=66kg
[R6Operative7]
ID_BIRTHDATE=1964.02.12
ID_HEIGHT=183cm
ID_HISTORY=Born in Pskov, Pskovskaya Oblast, Russian Federation. No information on family available. Served in army of former Soviet Union, 1981-85, including tour of duty in Afghanistan. Recruited by "Alfa" counter-terrorist group in 1987. Operated in all major territories of the former Soviet Union and eastern Europe. Resigned from "Alfa" in 1991 in response to that organization's ambiguous response to the failed Soviet coup. Director of operations for private security firm, 1991-96. Returned to "Alfa" during its 1997 restructuring under the Russian Federal Security Service. Married, no children.\n\nFilatov is a solid counter-terrorism operative. Although his training and background are unorthodox by western standards, he has a wealth of real-world experience from his years in the security forces of the former Soviet Union, and numerous contacts across Eastern Europe and Asia. His steady nerves and methodical approach to any threat make him a particularly valuable asset in combat situ
ID_HISTORY1=ations. Team commanders should not be misled by his world-weary manner; he is not a pessimist but a realist, and he prides himself on being the voice of reason and conservatism in any debate.
ID_NAME=Filatov, Genedy
ID_SHORTNAME=Filatov, G.
ID_WEIGHT=84kg
[R6Operative8]
ID_BIRTHDATE=1975.07.25
ID_HEIGHT=167cm
ID_HISTORY=Born in Nicosia, Cyprus. Galanos was thrust into the ethnic tensions on Cyprus from an early age, when her family lost their homes during widespread clashes between Turkish and Greek rioters. The Galanos family, while never physically harmed by the tensions, continued to suffer difficult times for many years due to the unrest. Eventually they fled the city, and Galanos's father, an ex-ELDYK sniper, taught her his trade in extended hunting trips through the center of the island. Galanos attempted to join the Greek MYK force, but was turned down due to her gender. Instead, she joined the civilian police force and quickly rose to prominence as a sniper with a reputation for precise shooting in less than optimal conditions.\n\nGalanos is, at times, a sheer force of nature. What she cannot achieve by skill alone, she often completes by force of will. Teammates often claim her piercing gaze does more damage than her bullets. She displays no antipathy towards Turks, or indeed any other nationality or cri
ID_HISTORY1=minal. She treats assignments as problems to be solved, and solves them with a single, clean trigger pull.
ID_NAME=Galanos, Kure
ID_SHORTNAME=Galanos, K.
ID_WEIGHT=58kg
[R6Operative9]
ID_BIRTHDATE=1975.09.10
ID_HEIGHT=196cm
ID_HISTORY=Born in Graz, Austria. Father is a petroleum distributor, mother a homemaker. Two siblings, a brother and a sister, both still in school. Joined the regular Austrian army in 1992. Transferred to Gendarmerieeinsatzkommando Cobra (GEK Cobra) in 1996. Trained with both Germany's GSG-9 and Israel's Sayeret Mat'Kal. Participated in GEK Cobra raid on Deissenmayr GmbH headquarters in Vienna in 1998 and was credited with single-handedly saving the lives of seven hostages. Married 1999, no children.\n\nIn combat situations Karl is unstoppable. He is extremely aggressive and will not hesitate to use whatever methods are necessary to complete his mission. He is fanatical about protecting the lives of hostages and innocent bystanders, even to the point of jeopardizing his own life. Off the job he is soft-spoken and private, but has an iron determination.
ID_NAME=Haider, Karl
ID_SHORTNAME=Haider, K.
ID_WEIGHT=117kg
[R6Operative10]
ID_BIRTHDATE=1965.04.14
ID_HEIGHT=187cm
ID_HISTORY=Born in Margaret River, Australia. Father is a winery foreman, mother is a homemaker. Two siblings, a brother and a sister. Attended Australian Defense Forces Academy in Canberra, 1983-87. Upon graduation was recruited into newly formed 1st squadron of the Special Air Service Regiment (SASR) and remained with this unit when it was reorganized into the Australian Tactical Assault Group (TAG) shortly thereafter. His entire career has been with TAG with the exception of one tour of duty with the Australian Intelligence Corp (AustInt), 1993-96. Has led counter-terrorist teams on three continents and has cross-trained with both the U.S. "Delta Force" and British Special Air Service. Unmarried.\n\nHanley is a career CT officer. He is a veteran of dozens of assaults and approaches even the most dangerous missions with the easy-going good humor that has become his hallmark. Off-duty he is an experienced backpacker and mountaineer and has taken part in amateur expeditions to many of t
ID_HISTORY1=he world's major peaks. He is in superb physical condition and has demonstrated an ability to endure even the most extreme physical hardship.
ID_NAME=Hanley, Timothy
ID_SHORTNAME=Hanley, T.
ID_WEIGHT=85kg
[R6Operative11]
ID_BIRTHDATE=1972.08.23
ID_HEIGHT=183cm
ID_HISTORY=Born in Boise August 23 1972. Father local logger, mother secretary at lumber mill. Brought up in true mountain man fashion, he shot his first deer at age 10. Former Green Beret and Delta member. Part of 101st AirMobile Fort Campbell, Kentucky, he found his way into Black Ops by 1989. Definitive distance runner, relies on stealth and speed to set up his sniper locations. Expert with all forms of rifles. Spends free time hunting with Weber and spending time with his parents. Unmarried.
ID_NAME=Johnston, Homer
ID_SHORTNAME=Johnston, H.
ID_WEIGHT=73kg
[R6Operative12]
ID_BIRTHDATE=1966.11.02
ID_HEIGHT=179cm
ID_HISTORY=Born in Göteborg, Sweden. Father was a retired admiral in the Swedish Navy, now deceased. Mother is a professor of Romance languages at Göteborg University and is active in Miljöpartiet de Gröna, the Swedish Green Party. Three brothers. The entire family sails avidly. Attended Stockholm University 1984-87, graduated with a BS in Physics. After a stint as an engineer with the Swedish semiconductor giant Microelektronik AB (1988-92), Lofquist joined the Stockholm police force as an expert on electronic surveillance. In 1994 she was recruited into Ordningspolisens Nationella Insatsstyrka (ONI), the national rescue unit of the Stockholm Police Department. From 1997 to 1999 she led ONI intelligence and surveillance teams in over a dozen different counter-terrorist actions, including the high-profile 1998 Red Cell occupation of the trading floor of the Stockholm futures exchange. Unmarried.\n\nLofquist is an electronics genius. Her name is on 14 different patents held by Microele
ID_HISTORY1=ktronik, her old employer, and she continues to consult with their engineers while serving as a member of the RAINBOW team. Most of her innovations have been in the area of electronic eavesdropping. She is extremely confident and courageous, although at times her lack of military training can lead her to overestimate her ability to handle a situation. Off-duty she keeps to herself, living alone on a sailboat in Saltsjobaden outside Stockholm.
ID_NAME=Lofquist, Annika
ID_SHORTNAME=Lofquist, A.
ID_WEIGHT=68kg
[R6Operative13]
ID_BIRTHDATE=1968.06.06
ID_HEIGHT=178cm
ID_HISTORY=Born in Paris, June 6 1968, married to Elaine, three years. Father former commercial pilot, mother is a clerk at local department store in Montpellier. Former member of the French Parachute Division, he was detailed to DGSE. Part of action group Service 7. Involved in tactical espionage and counter-espionage throughout Europe. Began training DGSE recruits in 1985. On assignments he is a utility player, and doesn't get shaken easily. He is a marksman with pistols and rifles, although he is experienced in all forms of counter-terrorism. He spends most free time reading and spending time with his wife.
ID_NAME=Loiselle, Louis
ID_SHORTNAME=Loiselle, L.
ID_WEIGHT=68kg
[R6Operative14]
ID_BIRTHDATE=1966.10.14
ID_HEIGHT=179cm
ID_HISTORY=Born in Milan, Italy. Father is the manager of a textile factory, mother is a homemaker. Five siblings. Attended Università degli Studi di Ferrara, 1984-88. Graduated with a degree in Chemistry. Joined L'Arma dei Carabinieri in 1989 and after completing training was assigned to the Comando Carabinieri Antidroga, the Carabinieri's anti-narcotics agency. Transferred in 1995 to the Gruppo Intervento Speciale (GIS), Italy's elite counter-terrorist team. Married since 1990. Three children.\n\nMaldini's specialty is stealth. At GIS his ability to occupy positions undetected by the enemy resulted in the nickname "The Invisible Man". He is in excellent physical condition and is exceptionally quick on his feet. His demeanor is calm and somewhat aloof. Although a solid team member, he is too introspective to be a truly effective commander. Off-duty he is an amateur marathoner and has competed in races across Europe. Extremely intelligent and well-spoken.
ID_NAME=Maldini, Antonio
ID_SHORTNAME=Maldini, A.
ID_WEIGHT=68kg
[R6Operative15]
ID_BIRTHDATE=1964.06.06
ID_HEIGHT=185cm
ID_HISTORY=Born in Toronto, Ontario, Canada. Father is a senior officer with the Royal Bank of Canada. Mother is deceased. One sister, still a resident of Toronto. Joined the Canadian Army as a Field Engineer, 1981. Served one tour of duty, 1981-85. Received advanced training in both combat diving and explosive ordnance disposal. Upon discharge joined the Royal Canadian Mounted Police (RCMP) and in 1988 became a member of the Special Emergency Response Team (SERT), the RCMP's elite counter-terrorism unit. When SERT was disbanded in 1993, he helped coordinate the transition of counter-terrorist responsibilities to the Canadian Armed Forces' newly formed Joint Task Force Two (JTF-2). McAllen re-enlisted in 1994 and became a full member of JTF-2 the same year. He has participated in counter-terrorist actions on three continents, including the JTF-2 extended operations in 1996-97 against war criminals in Bosnia. Married in 1984, divorced in 1992. One child, a daughter, born 1986, lives wi
ID_HISTORY1=th her mother in London,Ontario.\n\nMcAllen is a specialist in multiple areas. He is an excellent shot and is extremely aggressive in combat situations, making him a good choice as a member of an assault team, but he also has extensive experience with bomb disposal and demolitions. He is an amateur power-lifter and his strength and stamina make him a formidable opponent. Team leads should be warned that he performs better in a subordinate rather than a command position. He has a hearty, good-natured manner and spends his off-duty time socializing with a wide circle of friends, most of them current or ex-military men.
ID_NAME=McAllen, Roger
ID_SHORTNAME=McAllen, R.
ID_WEIGHT=95kg
[R6Operative16]
ID_BIRTHDATE=1965.12.24
ID_HEIGHT=186cm
ID_HISTORY=Born in Birmingham, Alabama, USA. Father is a retired furniture salesman, mother is a homemaker. Two younger sisters, both still living in Birmingham. Valedictorian of his high school class, National Merit Scholar, 1982. Attended Rice University in Houston, Texas, 1983-87, graduating with a BS in Material Science and a BA in Russian Literature. Joined the American Bureau of Alcohol, Tobacco and Firearms (BATF) in 1988 as an agent in their Explosives Division. Earned an MS in Inorganic Chemistry from the University of New Orleans during a leave of absence from BATF, 1992-1994. His thesis "Applications of Micro-stress Analysis in Accelerant Identification" is considered to be a landmark in the forensic analysis of bomb debris. Upon return to active duty in 1995 he was assigned to the BATF's International Response Team (IRT). Since 1998 he has been on extended assignment in South Korea with the Korean counter-terrorism task force, the National Police 868 Unit, training them in te
ID_HISTORY1=chniques of bomb detection, bomb disposal, and post-bombing investigation. His wife and two daughters currently live in Seoul, South Korea.\n\nMorris is a team player who likes his operations to run strictly by the book. His primary specialty is forensics, but he is also an expert at the setting and disarming of all types of explosive devices. Although he knows a fair amount about conducting counter-terrorist assaults from his years working with the 868 Unit, in hostage situations he prefers an indirect approach. Morris likes to spend his off-duty hours with his family. In his spare time he collects antique blues recordings and memorabilia.
ID_NAME=Morris, Gerald
ID_SHORTNAME=Morris, G.
ID_WEIGHT=96kg
[R6Operative17]
ID_BIRTHDATE=1971.04.03
ID_HEIGHT=170cm
ID_HISTORY=Born in Bani Suwayf, Egypt. Murad is the son of an influential moderate Muslim cleric, and grew up learning a great deal about both the religious and secular worlds. To the dismay of his pacifistic parents, Murad joined the Egyptian armed forces rather than continue his scholarship. Privately upset by the reputation of Egypt's Unit 777, Murad set out to change the organization from within. His contacts with US, British and German training units convinced him there was a better way, but that Egypt would not be taking that path soon enough for him. His exceptional skills, both linguistic and military, landed him a frequent cross training position with the SAS, where he came to the attention of RAINBOW.\n\nIn combat, Murad is a swift and lethal presence. Once he has committed a plan to memory, nothing stands in his way to accomplish that plan. Prior to the mission, Murad questions every detail of every plan, often infuriating the planning officers but ensuring that every possible consequen
ID_HISTORY1=ce and complication has been well thought out. His insistence that there is a Right Way has won him many admirers, if few friends.
ID_NAME=Murad, Jamal
ID_SHORTNAME=Murad, J.
ID_WEIGHT=74kg
[R6Operative18]
ID_BIRTHDATE=1967.01.12
ID_HEIGHT=164cm
ID_HISTORY=Born in Cartagena, Colombia. Narino's early activities are shrouded in mystery, a situation he enhances with conflicting stories regarding his training and upbringing. At various times, Narino has claimed to be the nephew of a Colombian drug lord, a failed university professor, an ex-police officer and a freedom fighter. Most team members believe that he learned his trade as a CIA assassin, a belief that Narino alternately encourages with outrageous stories or flatly denies with cold stares. Regardless, everyone agrees that Narino is a cool and composed marksman with a disquieting ability to sneak into exposed positions without being seen.\n\nNarino is a study in unpredictable mood swings. One minute joking and talkative, the next tight-lipped and silent. This never interferes with his professionalism on the job, but it has kept Narino at arm's length from the easy camaraderie pervading most of the team. This distance is especially noticeable during planning sessions, where he doesn't
ID_HISTORY1= contribute unless it is to point out an unorthodox sniping position.
ID_NAME=Narino, Emilio
ID_SHORTNAME=Narino, E.
ID_WEIGHT=82kg
[R6Operative19]
ID_BIRTHDATE=1959.06.08
ID_HEIGHT=175cm
ID_HISTORY=Born in Belo Horizonte, Brazil. His late father ran an import business. His mother is a homemaker. One older brother, two younger sisters. Attended college at the Brazilian military academy, Colégio Militar do Rio de Janeiro (CMRJ), 1977-81. Served two terms of duty with the regular Brazilian army before being recruited into the Counter-Terrorist Detachment (CTD) of the 1st Special Forces Battalion in 1987. Since 1995 he has commanded one of CTD's three squadrons. He has cross-trained with the U.S. "Delta Force", Chile's Unidad Anti-Terroristes (UAT), Argentina's Brigada Especial Operativa Halcon, and Columbia's Agrupacion De Fuerzas Especiales Urbanas (AFEU). In 1997 he was one of a group of senior Brazilian CTD operators who assisted the Peruvian armed forces in ending the occupation of the Japanese embassy by the Tupac Amaru Revolutionary Movement (MRTA). Married since 1985. His wife and two daughters live in Rio de Janeiro.\n\nNoronha has spent the majority of his military 
ID_HISTORY1=career as a CT operator. He is well-known in the CT community, particularly in North and South America, and has a reputation as a stern taskmaster. Although he has conducted actions in a wide variety of terrains and circumstances, he is particularly proficient in jungle operations and long-range intelligence gathering. In combat situations he is extremely aggressive and he expects the same from any team that serves under him. He has no sense of humor and considers it unprofessional in others. His only passion in life (aside from his work and his family) is classical music and opera.
ID_NAME=Noronha, Alexandre
ID_SHORTNAME=Noronha, A.
ID_WEIGHT=70kg
[R6Operative20]
ID_BIRTHDATE=1966.05.24
ID_HEIGHT=201cm
ID_HISTORY=Born in Minsk, in what is now Belarus. Novikov is the son of a career army officer; his family is politically very well connected, and has made the transition from the USSR to the CIS very well indeed. Novikov enjoyed the finest education and living standard available, including an engineering degree from the University of Moscow. He spurned the regular army to take a prized field position in the enforcement arm of the KGB, only to find it disintegrating beneath him. When his co-workers joined the forming Russian Mafias, Novikov left the city to return to Minsk where the newly independent Belarus army offered him a chance to lead a CT team of his own creation. A series of low profile but well-planned and executed missions brought him to the attention of RAINBOW, which Novikov gladly joined.\n\nNovikov combines the broad build of the Russian athlete with an incisive mind and stern leadership. He is capable of working much higher in the organization, but prefers field duty, even if it me
ID_HISTORY1=ans taking more orders than he gives. Other team members feel comfortable with Novikov in charge, as his personal bravery combines with sharp planning to virtually guarantee success.
ID_NAME=Novikov, Arkadi
ID_SHORTNAME=Novikov, A.
ID_WEIGHT=125kg
[R6Operative21]
ID_BIRTHDATE=1973.12.12
ID_HEIGHT=159cm
ID_HISTORY=Born in Kangnung, South Korea. Pak is a member of a large family of fishermen; he has four brothers and three sisters. He entered the South Korean army at the youngest age he could, so long as he would not have to serve on a boat, ever again. Despite (or perhaps because of) his slight build, Pak developed a reputation for physical prowess, particularly endurance. He was accepted into the 707th Special Mission Battalion, making battalion history by being the only inductee to exceed every one of the punishing physical tests exacted upon the battalion during training. He built his reputation up further by succeeding at lengthy solo infiltration missions behind North Korean lines, often in disguise for extended periods of time.\n\nPak is cheerful and optimistic at all times. While Recon operatives are not used in all missions, Pak manages to be in the center of the planning and discussion stages all the same.
ID_NAME=Pak, Suo-Won
ID_SHORTNAME=Pak, S.
ID_WEIGHT=45kg
[R6Operative22]
ID_BIRTHDATE=1970.12.14
ID_HEIGHT=189cm
ID_HISTORY=Born in Hamar, Norway. Parents owned and operated a ski resort high in central Norway. Began skiing at an early age; soon added hunting and shooting, to become an accomplished biathlete. Attempted and failed to win entry to Norway's Olympic Biathlon Team in 1988 and 1992, missing by fractions of a point each time. Joined Beredskapstroppen in 1990, after sister traveling in the Middle East was wounded in a terrorist attack.\n\nPetersen is a nearly unstoppable sniper if allowed the proper set-up time. He projects an air of icy calm at all times, prompting teammates to devise various pranks and embarrassing situations to disturb that calm. All attempts so far have failed. While aloof, his unerring accuracy has endeared him to the rest of the team. When not on duty, Petersen often embarks on lengthy solo cross-country skiing trips, disappearing into dense terrain for days at a time.
ID_NAME=Petersen, Einar
ID_SHORTNAME=Petersen, E.
ID_WEIGHT=73kg
[R6Operative23]
ID_BIRTHDATE=1958.09.21
ID_HEIGHT=186cm
ID_HISTORY=Born in London, September 21 1958. Father deceased, mother living in Cambridge, retired nurse. Price is a former color sergeant who served in the 22nd SAS at Hereford. Spot promoted to sergeant major, he spent time in Northern Ireland for the 14th Intelligence Company. Highly trained in techniques such as CQB, IR photography and covert surveillance, "The Company", as it is known, performs in Northern Ireland, monitoring known IRA terrorists and pre-emptively striking against terrorist targets. Involved in hostage rescue in Columbia, 1984, where scientist was on a research expedition. Extremely physically fit, and an expert marksman. Enjoys reading, smoking his pipe, and working out with Weber. Unmarried.
ID_NAME=Price, Eddie
ID_SHORTNAME=Price, E.
ID_WEIGHT=84kg
[R6Operative24]
ID_BIRTHDATE=1964.02.29
ID_HEIGHT=165cm
ID_HISTORY=Born Kazimiera Koziol in Gdansk, Poland. Her father and brothers worked in the shipyards and she was active from an early age in the movement that later become known as Solidarnosc. In 1981, when she was 17, she was beaten seriously enough by police to require hospitalization and in 1982 she was arrested during a street demonstration and spent the following year in jail. Upon her release in 1983, she resumed activity in the Solidarity underground while working odd jobs in and around Gdansk. Married in 1986 to Andrzej Rakuzanka, a fellow underground activist. With the shifting of political winds in 1989, and the founding of the Republic of Poland, she was able once again to make public her affiliation with Solidarity. In 1990 she joined the reconstructed Gdansk police force and quickly moved into undercover work to battle the growing organized crime problem in the newly liberated country. In 1993 she was recruited by the Grupa Reagowania Operacyjno Mobilnego (GROM), Poland's newly-fo
ID_HISTORY1=rmed counter-terrorist unit. Initially she was involved purely in intelligence gathering activities, but in 1994, when her unit took part in Operation Restore Democracy, the American-led invasion of Haiti, she was promoted to full-fledged CT operator. In 1998 she led her first assault team, and has since cross-trained with the U.S. "Delta Force", Norway's Beredskapstroppen, and Finland's Osasto Karhu. Her husband and two daughters reside in Gdansk.\n\nRakuzanka is a survivor. Despite her unassuming appearance she has an iron constitution and is capable of enduring extreme hardship. She is a strong team player and an excellent shot. She has a sarcastic way of speaking but always reserves her sharpest barbs for the rich and powerful. She is called "Kazi" by friends and family, and "Kamikazi" by her colleagues, although never to her face.
ID_NAME=Rakuzanka, Kazimiera
ID_SHORTNAME=Rakuzanka, K.
ID_WEIGHT=61kg
[R6Operative25]
ID_BIRTHDATE=1968.03.30
ID_HEIGHT=172cm
ID_HISTORY=Born in Kansas City, Missouri, USA. Father is a retired U.S. Army colonel, mother is a homemaker. Two older brothers. Attended University of Oklahoma, 1986-89, under Reserve Officers Training Corp (ROTC) program, majoring in Political Science. Entered regular U.S. Army upon graduation. Served in Kuwait, 1991. Recruited into U.S. Special Operations Psychological Operations (PSYOPS), 1992. Served in Bosnia, 1996-97. In 1998 was selected to take part in U.S. Army trial introduction of women into special operations ground combat forces. Trained with 1st Special Forces Operational Detachment-Delta (1st SFOD-D, "Delta Force") . Married since 1993. Husband is a lieutenant in U.S. Army, stationed in Frankfurt, Germany. One child, a daughter, born 1995.\n\nRaymond is extremely self-reliant and resourceful. An excellent combat soldier, she is also well-versed in a variety of types of psychological warfare, and understands how both soldiers and civilians react under the stress of comb
ID_HISTORY1=at. Although an experienced officer, she is too much of a loner to be at her best as a team lead and will be used to maximum advantage in a support role. She doesn't talk much, and weighs her words carefully when she does speak.
ID_NAME=Raymond, Renee
ID_SHORTNAME=Raymond, R.
ID_WEIGHT=64kg
[R6Operative26]
ID_BIRTHDATE=1974.05.17
ID_HEIGHT=190cm
ID_HISTORY=Born in Saarbrücken, Germany. Father is a safety engineer with Lufthansa, mother is a homemaker. Three younger siblings, two sisters and a brother. Amateur archer, competing in Germany junior national championships, 1990. Entered the German Federal Border Police Force (Bundesgrenzschutz) in 1994 at the top of his cadet class. Stationed at Saarbrücken, 1994-98. Recruited into Germany's elite counter-terrorist force, Grenzschutzgruppe 9 (GSG-9) in 1998. Completed GSG-9 training in record time, again at the top of his class. Temporarily attached to GSG-9/1, the group's primary CT strike unit, before reassignment to RAINBOW. Married since 1996. No children.\n\nWalther is currently the newest member of the RAINBOW team. His lack of experience in the field is balanced by his extraordinary drive and determination. He is a quick learner and an exceptional team member, following every order without hesitation or question. Although his primary training was as a member of an assault te
ID_HISTORY1=am, he is also well-versed in wire-tapping and electronic surveillance. He is clearly being groomed for advancement by the Bundesgrenzschutz command and his assignment to RAINBOW reflects the German government's long-term commitment to international CT collaboration.
ID_NAME=Walther, Jorg
ID_SHORTNAME=Walther, J.
ID_WEIGHT=105kg
[R6Operative27]
ID_BIRTHDATE=1971.07.09
ID_HEIGHT=191cm
ID_HISTORY=Born in Munich, July 9 1971, Father ironworker, mother deceased. Graduate of German Army's Bergführer or Mountain Leader schools, one of the physically toughest school in the world. Came from German GSG-9 team, which was part of the former Border Guards, the Federal Republic's counter-terrorism team. Fluent in English and German, his marksmanship is only matched by a few members on the team. Spends free time hunting, working out with Price, and practicing Tai Kwon Do. Unmarried.
ID_NAME=Weber, Dieter
ID_SHORTNAME=Weber, D.
ID_WEIGHT=98kg
[R6Operative28]
ID_BIRTHDATE=1971.07.14
ID_HEIGHT=155cm
ID_HISTORY=Born in Los Angeles, California, USA. Father is a doctor, mother a lawyer. No siblings. Amateur gymnast, competing in West Coast regional championships 1987-88. Attended UCLA University 1989-92, graduated with a BA in Psychology. Joined Los Angeles Police department in 1992, transferred to Metro Division S.W.A.T Team in 1994, where she specialized in surveillance and negotiation. Awarded commendation for bravery for role in ending the New Millennia occupation of L.A. City Hall in 1999. Unmarried.\n\nWoo is an expert on reconnaissance and surveillance. She can move quickly and quietly through terrorist-controlled areas and is well-versed in the installation and removal of a wide variety of electronic intelligence-gathering devices. She handles command well, but she has an independent nature and has been known to argue with her superiors. Her combat skills are average. Outspoken and self-reliant.
ID_NAME=Woo, Tracy
ID_SHORTNAME=Woo, T.
ID_WEIGHT=44kg
[R6Operative29]
ID_BIRTHDATE=1973.03.03
ID_HEIGHT=163cm
ID_HISTORY=Born in Tel Aviv, Israel. Father is a greengrocer, mother died when Ayana was three. One younger brother, plays professional soccer for Beitar Jerusalem. Joined the regular Israeli army, 1992. Transferred to Sayeret Mat'kal in 1995, where she served in the general staff reconnaissance unit. Recruited in 1997 by the Mossad. Specialization in infiltration and intelligence gathering. Speaks fluent English and Arabic. Unmarried.\n\nAyana is a master of the silent kill. Her training has prepared her for moving stealthily into hostile territory and neutralizing whatever threats may confront her. She is extremely intelligent with little tolerance for fools. The quintessential professional, she has been known to complain about the "cowboy attitude" of some of the other members of the team. Ruthless in combat, in non-military situations she may err on the side of excessive force.
ID_NAME=Yacoby, Ayana
ID_SHORTNAME=Yacoby, A.
ID_WEIGHT=57kg
[R6RookieSniper]
ID_HISTORY=None
ID_NAME=Back-up Sniper
ID_SHORTNAME=Sniper
[R6RookieRecon]
ID_HISTORY=None
ID_NAME=Back-up Recon
ID_SHORTNAME=Recon
[R6RookieElectronics]
ID_HISTORY=None
ID_NAME=Back-up Electronics
ID_SHORTNAME=Electronics
[R6RookieAssault]
ID_HISTORY=None
ID_NAME=Back-up Assault
ID_SHORTNAME=Assault
[R6RookieDemolitions]
ID_HISTORY=None
ID_NAME=Back-up Demolitions
ID_SHORTNAME=Demolitions
[R6RetiredOperative]
ID_HISTORY=None
ID_NAME=Retired Operative
ID_SHORTNAME=Retired Op.
